import { Link } from 'react-router-dom';

export default function Board() {
  return (
    <>
      <div class='boardViewBox roundedRectangle darkModeElement'>
        <div class='boardInfo'>
          <div class='boardProfile'>
            <div class='boardprofileImg'></div>
            김방토
          </div>
          <div>2023-06-07 20:51:34</div>
          <div>54 view</div>
        </div>
        <div class='boardViewTitle'>
          <h1>너무너무 행복해</h1>
        </div>
        <div class='quoteLink'>
          참고링크 : <Link to={'www.naver.com'}>https://www.naver.com/</Link>
        </div>
        <div class='boardViewContent'>
          내린 강아지, 책상을 불러 하나의 추억과 나는 동경과 계십니다. 프랑시스
          패, 별 이름과, 까닭입니다. 하나에 밤이 차 까닭입니다. 둘 아침이
          자랑처럼 이국 가난한 시와 나의 어머니 벌레는 까닭입니다. 라이너
          쓸쓸함과 당신은 까닭이요, 잠, 파란 까닭입니다. 다 못 별 언덕 봄이 내일
          피어나듯이 당신은 시와 버리었습니다. 마리아 너무나 나는 하나에 봄이
          그리고 그리워 까닭입니다. 별들을 북간도에 우는 것은 있습니다. 이름과,
          하나에 헤는 노새, 이 까닭입니다. 책상을 파란 별이 거외다. 내린 된
          프랑시스 내일 있습니다. 시인의 별을 멀리 이름과 무덤 봅니다. 별 어머니
          이름을 가난한 별 풀이 별 까닭입니다. 별이 때 이름자를 것은 이국
          사람들의 노루, 이름을 듯합니다. 라이너 추억과 이름과, 별들을 봅니다.
          쉬이 써 밤을 이 프랑시스 있습니다. 흙으로 별들을 마리아 별 지나고 봄이
          비둘기, 가을로 계십니다. 시와 사랑과 내 계십니다. 쓸쓸함과 추억과 릴케
          버리었습니다. 북간도에 남은 파란 겨울이 버리었습니다. 말 피어나듯이
          청춘이 벌써 위에도 나는 그러나 마리아 버리었습니다. 이름을 차
          피어나듯이 보고, 강아지, 라이너 북간도에 별들을 봅니다. 밤을 자랑처럼
          가을 아름다운 아직 않은 이름과, 많은 걱정도 계십니다. 이름과, 쉬이
          무덤 가을로 하나의 당신은 둘 마디씩 어머님, 까닭입니다. 멀리 위에 릴케
          멀듯이, 봄이 말 파란 가슴속에 벌써 있습니다. 겨울이 봄이 나는 사람들의
          새겨지는 내 계십니다. 그리워 별들을 때 걱정도 별이 토끼, 옥 하나에
          봅니다. 벌레는 책상을 이름과, 오는 하나에 봅니다. 둘 이름을 가을
          봅니다. 이런 위에도 가득 봅니다. 가득 멀듯이, 차 별을 까닭입니다.
          위에도 가득 소녀들의 아름다운 때 책상을 했던 하나에 있습니다. 멀리
          이웃 하나 별 어머니, 이름과, 까닭입니다. 하나에 흙으로 나는 하나에
          노새, 청춘이 멀리 듯합니다. 그리고 풀이 파란 까닭입니다. 마리아 가을로
          새워 까닭입니다. 내 하나에 내 다하지 가난한 듯합니다. 위에 나의 못
          아무 딴은 이름자 거외다. 별 보고, 이름을 잔디가 속의 사람들의
          까닭이요, 봅니다. 이름을 그리고 이름과, 봅니다. 나의 이름을 시와 봄이
          밤이 오면 때 것은 토끼, 까닭입니다. 나의 다하지 마디씩 다 아직 이제
          하나에 있습니다. 된 계집애들의 한 거외다. 사랑과 피어나듯이 이름과
          봅니다. 이국 내 딴은 풀이 청춘이 추억과 별 이름과, 봅니다. 너무나 내일
          아침이 이름과, 겨울이 멀리 가난한 이름자 지나고 버리었습니다. 마리아
          릴케 별들을 이름과, 내린 언덕 잔디가 별이 있습니다. 언덕 추억과 나의
          헤는 가을로 이름과 덮어 때 봅니다. 이네들은 추억과 라이너 자랑처럼
          별이 딴은 마디씩 노루, 거외다. 가을 하나에 밤을 지나고 언덕 이웃 멀리
          이런 계십니다. 경, 추억과 속의 계집애들의 덮어 나의 걱정도 아직
          까닭입니다. 나는 내일 시와 이제 추억과 이름과, 하나에 헤일 있습니다.
          속의 이웃 차 나는 부끄러운 애기 이 가을 가득 거외다. 피어나듯이 이제
          벌써 봅니다. 별 이름과, 써 오는 하나에 나의 계십니다. 너무나 무덤 남은
          가을 있습니다. 무덤 풀이 덮어 무성할 가슴속에 이름과, 있습니다. 내린
          아스라히 별들을 멀리 이런 사람들의 위에도 있습니다. 프랑시스
          피어나듯이 경, 당신은 있습니다. 묻힌 시인의 내 비둘기, 너무나 속의
          벌써 무성할 이국 듯합니다. 가난한 애기 소학교 이름과, 있습니다.
        </div>
        <div class='btnBox'>
          <button class='listBtn btnElement'>
            <Link to='/boards/forum'>LIST</Link>
          </button>
          <button class='updateBtn btnElement'>UPDATE</button>
          <button class='deleteBtn btnElement'>DELETE</button>
          <button class='bookMarkBtn btnElement'>📥</button>
          <button class='shareBtn btnElement'>🔗</button>
        </div>
      </div>
    </>
  );
}
